OdDAI.Iterator.type
\details
Retrieves the type of the current element referred to by the iterator.
\returns
An instance of the OdRxValueType class
that contains information about the type of the current element.

OdDAI.Iterator.testCurrentMember
\details
Determines whether the value of the current array element referred to by the iterator is set.
\returns true if the value of the current element is set; otherwise, the method returns false.
\remarks
Applicable only for arrays.

OdDAI.Iterator.getValueBound
\details
Retrieves the value bound of the current element referred to by the iterator.
\returns An unsigned integer value that represents the value bound.

OdDAI.Iterator.unsetCurrentMember
\details
unset current element from an Array.
\returns true if the element is successfully unset; otherwise, the method returns false.
\remarks
Applicable only for arrays.

OdDAI.Iterator.removeCurrentMember
\details
Removes the current element from an aggregate.
\returns true if the element is successfully removed; otherwise, the method returns false.

OdDAI.Iterator.addAfterCurrentMember(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds a new specified element to the list aggregate after the element referred to by the iterator.
The new element is added after the current element; the current element that the iterator refers to is not changed.
\param anItem [in] An instance of the OdRxValue class that represents the new element to be added.
\remarks
The method throws an exception with the AI_NVLD code value if the aggregate instance is not a list.

OdDAI.Iterator.addBeforeCurrentMember(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds a new specified element to the list aggregate before the element referred to by the iterator.
The new element is added before the current element; the current element that the iterator refers to is not changed.
\param anItem [in] An instance of the OdRxValue class that represents the new element to be added.
\remarks
The method throws an exception with the AI_NVLD code value if the aggregate instance is not a list.

OdDAI.Iterator.putCurrentMember(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new current element of an aggregate for the iterator.
The new element replaces the previously current element.
\param anItem [in] An instance of the OdRxValue class that represents the new element to be set as current.

OdDAI.Iterator.getCurrentMemberValue
\details
Retrieves the value of the current element of an aggregate referred to by the iterator.
\returns An instance of the OdRxValue class
that represents the value of the current element referred to by the iterator.

OdDAI.Iterator.getCurrentMember
\details
Retrieves the current element of an aggregate referred to by the iterator.
\returns
An instance of the OdRxValue class
that represents the current element referred to by the iterator.

OdDAI.Iterator.createAggrInstanceAfterCurrentMember
\details
Creates an aggregate and places it after the current element referred to by the iterator.
\returns A raw pointer to the created aggregate instance.
\remarks
This method can be used to create nested aggregates.

OdDAI.Iterator.createAggrInstanceBeforeCurrentMember
\details
Creates an aggregate and places it before the current element referred to by the iterator.
\returns A raw pointer to the created aggregate instance.
\remarks
This method can be used to create nested aggregates.

OdDAI.Iterator.createAggrInstanceAsCurrentMember
\details
Creates an aggregate and makes it the current element of the iterator.
The created aggregate replaces the current item referred to by the iterator.
\returns A raw pointer to the created aggregate instance.
\remarks
This method can be used to create nested aggregates.

OdDAI.Iterator.previous
\details
Moves the iterator to the previous element of an aggregate relative to the current one.
The previous element becomes the current one unless the beginning of an aggregate is reached.
\returns
true if the move to the previous element was performed successfully; otherwise the method returns false.
The false value returned by the method means that the beginning of the aggregation container is reached and the iterator can not be moved anymore.
\code
for (it->end(); it->previous(); )
{
it->getCurrentMember()...
}
\remarks
Applicable for ordered aggregates (arrays, lists).

OdDAI.Iterator.next
\details
Moves the iterator to the next element of an aggregate relative to the current one.
The next element becomes the current one unless the end of an aggregate is reached.
\returns
true if the move to the next element was performed successfully; otherwise the method returns false.
The false value returned by the method means that the end of the aggregation container is reached and the iterator can not be moved anymore.
\code
for (it->beginning(); it->next(); )
{
it->getCurrentMember()...
}
\remarks
Applicable for ordered aggregates (arrays, lists).

OdDAI.Iterator.Dispose
\details
Destroys the iterator object.

OdDAI.Iterator
\details
An abstract class that provides the interface of an iterator for traversing through an aggregate.
An iterator provides sequential access to data objects in an aggregate.
Sequential access assumes that before getting access to an element you have to read elements
that are placed before the desired element in the aggregate.